* test cleanup: remove synthetic records left by a previous verify run
DEFINE DATA LOCAL
1 V VIEW OF EMPLOYEES
  2 PERSONNEL-ID
1 #N (I4)
1 #LINE (A) DYNAMIC
END-DEFINE
DEFINE WORK FILE 5 '/sync/work/cleanup.txt' TYPE 'ASCII'
RESET #N
READ V BY PERSONNEL-ID STARTING FROM 'ZZ'
  IF SUBSTRING(PERSONNEL-ID,1,2) NE 'ZZ'
    ESCAPE BOTTOM
  END-IF
  ADD 1 TO #N
  DELETE
END-READ
END TRANSACTION
COMPRESS 'CLEANED' #N INTO #LINE
WRITE WORK FILE 5 VARIABLE #LINE
CLOSE WORK FILE 5
END
